[
    {
        "body": "It's the hope that kills you"
    },
    {
        "body": "Jake Chervinsky, GC of the Blockchain Association, and Jerry Brito, head of Coincenter- both critical components of the US crypto lobby- were optimistic about the Biden EO today, saying that the tone was positive and that the industry can work with it.   These people know what they're talking about."
    },
    {
        "body": "South Korea just elected a president that wants to deregulate crypto markets. For some context South Korean crypto markets are over regulated in contrast to what we see in the west."
    },
    {
        "body": "Thus far in 2022, most Thursday’s have been dips and often the start of larger dips. I know that’s not a reliable indicator, but it’s there and makes me expect red Thursday’s."
    },
    {
        "body": "I'm starting a new exercise where I write down my assessments of probabilistic scenarios, to better inform my trading plan and how I should design my risk. I think it's really clarifying to get things out of your head and down on a page. Obviously I, like everyone, have no idea what's going to happen, but mapping out possible scenarios is really helpful in designing a trading plan, which traders should always have. If people are interested in this type of content, I'll keep posting it here. Also interested to hear people's takes on my perspective.\n\n\\----------------------------------------\n\nContext: BTC broke out 10% to the upside, bolstered by news of positive executive order. Pullbacks on commodities and safe havens line up with a bounce for risk assets overall. QE ends today, first rate hike next week. Although the long-term macro remains uncertain at best with rising inflation, late-cycle signals and the proposed end of central bank support, all of the expected short-term bearish catalysts are now out in the open. Relief for risk assets is overdue and this could set up for daily continuation.\r  \n\r  \n\\- Continuation with shallow/no pullback - 60%. Lots of confluence for continuation in the short term. BTC resisted putting in new lows over the last six weeks, despite widespread bearishness and negative catalysts. Indicates weakening of multi-month bear trend, increasing probability of continuing bullish momentum. If we have set a macro low, these types of rallies tend to continue without much relief for bears. Our reversal last July was followed by ten green daily candles in a row. If we're to continue upwards, there isn't much reason to pull back at these levels, and the market knows that. Continuation after a brief consolidation is the highest probability scenario. Ideal entries for this scenario are around 41.5k\n\n\r  \n\\- Reversal into continued chop or downtrend - 25%. The second most likely scenario is that this is another bounce, and people are only getting bullish because the price has gone up. This scenario is judged as being relatively likely due to high time frame directional bias, which is down. Reasoning is bearish macro backdrop, an incomplete bear cycle following years of bullishness, overall belief in cycles of psychology and liquidity. Most charts could have impressive rallies over the coming weeks only to make macro lower highs. This backdrop reduces the probability that momentum will show up after a move like yesterday. However, this is judged as less likely overall due to relief being overdue, and continued chop being unnecessary for accumulation or distribution after nearly two months of range.\n\n\r  \n\\- Substantial pullback before continuation - 10%. The most obvious horizontal level for this would be the 39k region. It's acted as resistance on lower time frames for a few weeks now, so an S/R flip of that level before continuing to higher targets is a possible scenario.  This is judged as being relatively unlikely, as we've already seen plenty of accumulation if we're to continue up from here, and such a pullback would essentially erase yesterdays move, making the chart unattractive to momentum players.\n\n\r  \n\\- Prolonged consolidation at current level - 5%. Staying at these levels for multiple days is judged as the least likely for a couple of reasons. Prior arguments for momentum versus additional accumulation apply. The major argument for this scenario is that 42k is a very significant level on higher timeframes stretching back more than a year. Establishing a base here could set the ground for more upside, but with the amount of volatility in the overall picture right now, it's more likely that we'll continue in one direction or another within a short time.\n\n\\---------------------------------------------\n\nThe major reason I'm putting more weight on the bullish scenario is that I feel we've had ample time to price in the known bearish catalysts, meanwhile failing to put in lower lows. While my current view is that a full-on bull trend to new all-time highs is less likely, I feel like bulls have \"clear skies\" in the short term, and a rally off these levels could easily take us up to challenge 50k. My bias started turning bullish yesterday as we continually revisited 39k, but unfortunately I didn't get the pullback I wanted to enter on before our violent breakout. r/R is not as good for longs from this current level, but I'm planning to take on about half the risk I'd want to have on in a scenario where we have a multi-week rally off a macro low, with plans to assess my positioning based on reactions to important levels (and events, of course) in the coming hours and days."
    },
    {
        "body": "If we just hold this range for a few days a lot of downtrends from peak will be broken across the market"
    },
    {
        "body": "When alcoholic I become"
    },
    {
        "body": "[deleted]"
    },
    {
        "body": "*Yawn* let me know in a couple days if we don’t retrace this entire move."
    },
    {
        "body": "Day 31 is here (current price $42k). Finally! We aren’t at the same price we were yesterday (and the day before)! This kind of morning is like waking up to a rainbow. The reality is we are still in a multi month sideways trend, staying between $35k and $45k. $42k has been broken too many times in both directions to continue to hold significance in my head.  $45k(ish) is what I’m focused on now. I already have a bottle of Bailey’s ready to pop for my morning coffee when we wake up to $45k. \r\n\nWhy the current move up? Either because the stock market is up or because [Biden and Yellen](https://www.cnbc.com/2022/03/09/bitcoin-btc-jumps-after-treasury-statement-on-crypto-executive-order.html) are about to open Coinbase accounts! Maybe not that extreme, but the U.S. wants to be considerate and not break crypto when they look to regulate it. That’s the best we can hope for. While I’d be ready to debate both sides of the issue, regulations will provide clarity to a boatload of institutional money that’s ready to be invested. \r\n\n“Rounding out the Bottom” continues to be my motto as we recover from the steady post-69 (he-he) drop. It’s good odds that $32k was bottom and we should begin seeing positive week-over-week returns. \n\nHave a Happy Day!"
    },
    {
        "body": "Last chance to buy over 40k!"
    },
    {
        "body": "bye bye 30k's it was fun while it lasted"
    },
    {
        "body": "[deleted]"
    },
    {
        "body": "Damn crypto you scary"
    },
    {
        "body": "I know this is likely to get backlash, but you can capitalise on the S&Ps correlation to BTC during market downtrends - Note: This correlation is proved quantatively with regression analysis, not just subjectively.\n\nIt was very evident this week. Recent regression analysis shows the S&P and BTC are correlated over 60%. A falling S&P is a leading indicator to BTC. If BTC is up and the S&P is falling strongly, BTC is likely to follow. Likewise, the subsequence crypto market treats BTC as an index, (for example, the derivative of ETH  and BTC are correlated by 90% in regression analysis). Thus, you can short the alt market based on BTC moves.\n\nYou can actual capitalize on this going the other way. For example, word is the Russian stock exchange is likely to open soon (hence ruble recovering 60% overnight). Word is BTC is correlated to the developing markets (though I havent verified this myself). However, notice crypto markets were up overnight, likewise with developed markets and ruble before NYSE opened. This all hints that the S&P is likely to open higher, and it did.\n\nIt can also work the other way. If foreign markets are all heading down overnight, with crypto added to the pullback, its likely the S&P will open lower with a downtrend.\n\ntl;dr S&P downtrends can be used as a leading indicator for crypto price moves after close.\n\nEdit: Correcting numbers.\n\nEdit: I [recorded another educational video talking about it](https://www.tradingview.com/chart/SPX/6TaSHCM0-BTC-Foreign-Markets-SPX-Developing-Markets-Lead-Lag-BTC/)"
    },
    {
        "body": "The last couple of months made me a pessimistic. I don’t believe this pump. Probably a short squeeze."
    },
    {
        "body": "Definite selling into the pump on chain. Price increased anyway.\n\nSame types addresses waking up who sold into the 45k pump at least on my initial take. \n\nWhen that dries up, things might get interesting very quickly."
    },
    {
        "body": "Intrigued to see how the current political goings on might affect the spot ETF approval.  And if the spot ETF approval would lead to a massive pump followed by a dump (like BITO)"
    },
    {
        "body": "It’s the news of Bidens positive crypto outlook."
    },
    {
        "body": "higher low only"
    },
    {
        "body": "😂"
    },
    {
        "body": "Tellin' you guys, those fib lines from Jan 1 open (47.7k) to 2022 low (32.9k) are all interesting lines to be watching. We've been straddling the 61.8 all day since the pump. The 50% is 40.3k. I hope 40k can hold"
    },
    {
        "body": "Don't have a cow, man"
    },
    {
        "body": "looking forward to watching this retrace back to 38k over the next couple weeks"
    },
    {
        "body": "So is biden suppose to have a press conference regarding the crypto executive order? Or is this news pretty much done and there is nothing more left?"
    },
    {
        "body": "This is quite a comfortable bear market"
    },
    {
        "body": "Nothing burger confirmed big thanks to Sam @ ftx #2 Biden donor for saving crypto again \n\nhttps://www.whitehouse.gov/briefing-room/statements-releases/2022/03/09/fact-sheet-president-biden-to-sign-executive-order-on-ensuring-responsible-innovation-in-digital-assets/"
    },
    {
        "body": "Id say this is the reason. https://twitter.com/anders_aslund/status/1501315627386118145?t=8pdo6dlBwq60sImpCd7c7A&s=19"
    },
    {
        "body": "90 coins in asks at 43k on finex makes it near certainty. Feel like I should be long already. But it's a bear market and I'm meant to short every bounce right?\n\nhttps://i.imgur.com/dGPF7b8.png\n\n[Div detecting indicator](https://www.tradingview.com/script/2zcXPgXN-RS-RSI-Divergence-V5/) has found a hidden div on the daily (it compares `rsi(low)` and `low` for bulldivs and `rsi(high)` vs `high` for beardivs). It's kind of meaningless though in the middle of ranging, hidden div is for continuation and I wanted to see a strong daily or weekly bulldiv...\n\nhttps://i.imgur.com/SXZGw88.png\n\nIt detects as 3 reasonably strong bulldivs on the 4h, so I guess that's something.\n\nhttps://i.imgur.com/irUfIQH.png"
    },
    {
        "body": "Wow. We just gonna keep goin between 37k to low 40s all month? Some magic money tree shit right there if that’s the case. Bought on Sunday at 38k will sell near 44k. Probably a gamble but fuck it. Not entirely convinced we’re gonna drastically break in either direction. Anyone else trading or na"
    },
    {
        "body": "We went from bear to bull in the last couple hours."
    },
    {
        "body": "Could be just coincidence but Monero is the only alt that pumped up on the ratio during this Bitcoin pump. Might throw a bit of light on the drivers."
    },
    {
        "body": "50K EOW!"
    },
    {
        "body": "Sanctions Russian means reduced liquidity, couple that with fundamental demand of non-sanctionable asset, we may see serious pump very soon. Well, nickel short squeezed yesterday, silver or gold may be next. It is only a matter of time before bitcoin make the headline again."
    },
    {
        "body": "Is everyone selling at 44k and buying back at 38k?\n\n(sets Sell order at 43,999!)"
    },
    {
        "body": "When Lambo?"
    },
    {
        "body": "Can't wait to see everyone make up the reasons for this jump"
    },
    {
        "body": "I don't even know anymore man"
    },
    {
        "body": "Congrats to everyone who just got nuked, you'll be better prepared for the Russian ones."
    },
    {
        "body": "[removed]"
    },
    {
        "body": "Eurostonks pumping hard for some reason. I don’t have a clue why, but the relief is welcome. There is probable some correlation with Bitcoin."
    },
    {
        "body": "Hope all of you are well. I've been busy and watch charts much less frequently these days.\n\nI was just thinking of something, though: on places like Robinhood and PayPal where you can't actually withdraw or deposit your Bitcoin, how does it even keep its peg to Bitcoin's actual value? There's no way to arbitrage it or buy anything with it."
    },
    {
        "body": "it will retrace, always does"
    },
    {
        "body": "For seemingly no reason at all. Lol"
    },
    {
        "body": "DXY (USD) hit a nice resistance but I just don't trust this rally still. Every time in the past we lost the 50 week MA we dropped to the 200 week (at 20k currently). We still haven't had a capitulation in the weekly RSI zone. The only hope I see for bulls is that everyone is bearish, but we had that before the March 2020 drop, but hopefully maybe this time is different (grimace face)\n\nhttps://www.tradingview.com/x/4jexGLt1/\nhttps://www.tradingview.com/x/KT0b3v3E/\n\nEdit: Everyone tells me people are bearish but you guys really hate any bearish analysis lol."
    },
    {
        "body": "Pump is from treasury 'accidentally' releasing a positive statement on upcoming executive order.\n\nIs it possible they want to encourage 'risk on' sentiment right now to pull markets back from the brink?"
    },
    {
        "body": "[removed]"
    },
    {
        "body": "glad we got the dump over with. that wasnt so bad .  nice volume and we setting up another higher low"
    },
    {
        "body": "Very important thread about what disgusting Elizabeth Warren is cooking up....this is what her voters/party appear to support (in the absence of opposition)\n\nhttps://twitter.com/twobitidiot/status/1501722352647905283"
    },
    {
        "body": "Wait for Q4 to go allin?"
    },
    {
        "body": "any dubious speculation on what this means? or is he just engagement trolling.\n\nhttps://twitter.com/BarrySilbert/status/1501543476814561282"
    },
    {
        "body": "Many people are looking at a symmetrical triangle with lower highs and higher lows.  This view makes sense to me and seems like one can stll gain decent amount of profit trading accordingly.  Eventually i think we break out of the triangle and hit 52k before running into a huge resistance."
    },
    {
        "body": "This rally will fail like the others..."
    },
    {
        "body": "Zoom out folks. This is a bear market and is a temporary step"
    },
    {
        "body": "[removed]"
    },
    {
        "body": "Very inefficient move up again from like 39.6-40.4 nearly no volume.  Look for that to get fix when this rolls over (if you are looking to short)"
    },
    {
        "body": "Negative correlation between BTC and gold is interesting.  I unironically think a portfolio of BTC and gold would be the portfolio for the next decade.  Flight to hard money is all I see coming.  Gold [did a 10x](https://inflationchart.com/spx-in-gold) in decades before when stocks stalled.  BTC is slowing down (previous cycles have been 500x, 100x, 20x from cycle low to top), owning both and letting them rebalance yearly is looking attractive to me.  They will fight, but just own both and profit from it?"
    },
    {
        "body": "I've been holding since the recent 49k... I have strong hands kids. These pumps mean nothing to me.  Next time wake me up when Elon tweets about it or in case there's some Salvador-level country adoption news."
    },
    {
        "body": "[deleted]"
    },
    {
        "body": "What were you guys saying about those boomer rocks again?"
    },
    {
        "body": "[deleted]"
    },
    {
        "body": "Inflation hedge seems to unsurprisingly be running from the CPI print tomorrow.\n\nI really do feel bad for people that bought this pump.  I’m sorry, we tried to help.  We weren’t just being negative."
    },
    {
        "body": "Pretty clear to me at least that Barry Silbert sold the pico recent top at 45k (said hes buying) but dropped hard from the peak, classic market maker move for liquidity. Do we really think he's scalping amd bought back only 10k lowet? Highly doubt it, Im sure he wants a deep discount, we probably don't get back to 45k for a decent while."
    },
    {
        "body": "[removed]"
    },
    {
        "body": "What do they say about Warren's bill?"
    },
    {
        "body": "South Korean crypto markets are not regulated. They have strict KYC requirements on most financial services, including crypto exchanges, but any citizen with a bank account and a mobile number (ie, 99.9% of their population) can sign up and get verified within minutes. Once you're in, there's essentially no restrictions on what you can do. They don't even pay taxes on crypto transactions of any sort.\n\nAlso, not really related to crypto, but FUCK the guy they just elected. He's a populist piece of trash with zero background in politics and zero actual policies planned for his presidentship, the only reason he got elected is because the current ruling party is essentially anti-populism, COVID and on-going housing crisis made everyone mad, and folks blame all of their problems on them."
    },
    {
        "body": "It's good to document the sort of general malaise that only the genius possess and the insane lament."
    },
    {
        "body": "Keeping my eye on this, too. Getting pretty close to big diagonals on a lot of tokens."
    },
    {
        "body": "Boomer rocks lmao"
    },
    {
        "body": "Bingo"
    },
    {
        "body": "Thank you I look forward to these"
    },
    {
        "body": "You chose a nice ranging month to document! I'd like to see this when all markets aren't correlated xD"
    },
    {
        "body": ">Why the current move up? \n\nshorts closing, late shorts squeezing, dead cat bounce bull trap."
    },
    {
        "body": "30k? Never heard of em"
    },
    {
        "body": "I know this is happening. I follow a nude model, who is just travelling around the world, and she had money in her Russian bank at home. Now she posted on instagram, saying that she ,,has to learn how this crypto thing works''."
    },
    {
        "body": "Not sure how they gonna exit into bitcoin with swift, visa and mastercards not working. I think they are just stuck with the Ruble"
    },
    {
        "body": "Thanks for the advice."
    },
    {
        "body": "I have always followed S&P movements closely. I keep seeing people say btc tracks NDAQ, but I don't see it. Where do you source your foreign market data from if you don't mind me asking?"
    },
    {
        "body": ">Thus, you can short the alt market based on BTC moves.\n\nThese are some of my favorite trades to make, but I've learned to only use BTC for overall directional bias and confluence. Too many times I've had the beta break down and the asset move unexpectedly on the timeframe I'm trading."
    },
    {
        "body": "Definitely a short squeeze, there were lots of liquidations around 41k"
    },
    {
        "body": "You're right to be cautious. We're pumping over the language in these two press releases, but the language around climate risk and consumer protection / securities could result in the only permitted \"innovation\" being a CBDC. Maybe I'm too battered, but I don't trust it at all."
    },
    {
        "body": "When have these coins been acquired i.e. the coins being sold or moved now were last moved when?"
    },
    {
        "body": "I believe we are getting close with the new EO coming. \n\nWe probably see a similar scenario as the breakout summer 2021. We will move higher and breakout for 6-8 weeks and there will be plenty of speculation. It will then be announced that we get a spot ETF approval and we move to the next higher high and get the next blow off."
    },
    {
        "body": "Spot ETF is a very different product than a pure trading vehicle like BITO."
    },
    {
        "body": "it will be a huge H12 candle that will be retraced in a couple days like the one we just had."
    },
    {
        "body": "What news came that now deemed it positive when it wasn't perceived that way earlier?"
    },
    {
        "body": "I guess most expected outcome with CPI tomorrow and interest rates decision next week"
    },
    {
        "body": "Pretty optimistic or you to think it will take a couple of weeks."
    },
    {
        "body": "At this rate, we will retrace in two more days."
    },
    {
        "body": "You spelled 'hours' wrong"
    },
    {
        "body": "Speak of the devil…"
    },
    {
        "body": "no conference he probably has no clue what this is. Least important thing on his list"
    },
    {
        "body": "Maybe after his lunchtime nap?"
    },
    {
        "body": "We can only hope it's as tame as the bull market was"
    },
    {
        "body": "No idea how cozy."
    },
    {
        "body": "For real though, i guess it depends on how long you've been holding. I absolutely love being way up on the 4 year"
    },
    {
        "body": "Probably means things are going to get much, much worse."
    },
    {
        "body": "lots of \"explore\" and \"support\" and talks of \"investigating\" in everything I have seen.  Usually its a virtue signal that \"I totes care about this, and ill stop the evil crypto people from helping the Russians\" but in the end will do very little.\n\nThough looking forward to the multitude of propaganda articles circle back through that BTC is a tool of \"white nationalists\" and \"white supremacists\""
    },
    {
        "body": "All I see is mr. Crab"
    },
    {
        "body": "The world is volatile af now and BTC will be as well."
    },
    {
        "body": "Monero pumped hours before BTC"
    },
    {
        "body": "Numerous alts pumped. They randomly pump all the time"
    },
    {
        "body": "best comment in the thread"
    },
    {
        "body": "60k EOM"
    },
    {
        "body": "100k winter 2017"
    },
    {
        "body": "Everyone is shorting 43,2 and getting liquidated at 45,3"
    },
    {
        "body": "I don't have a target in mind, but I plan to do a swing trade in the coming 2-3 days. I think this upside won't last longer."
    },
    {
        "body": "I am. In this current fucked up macro economic condition, i’m more bearish than bullish."
    },
    {
        "body": "2025"
    },
    {
        "body": "I heard a rumor that it’s cuz there’s more buying than selling."
    },
    {
        "body": "Looks like lots of people missed their entry. Shame."
    },
    {
        "body": "I can't wait for this pump to retrace."
    },
    {
        "body": "IRS to accept payment in Bitcoin. 🤪"
    },
    {
        "body": "Nobody makes up shit. Everyone is just inaccurately regurgitating what they saw on CT. The Human centipede of thought."
    },
    {
        "body": "Is it not the leaked Yellen comment on mush-for-brains executive order?"
    },
    {
        "body": "What insightful analysis you got there bud"
    },
    {
        "body": "Did we know previously?"
    },
    {
        "body": "Ethbtc has been falling for months. It’s just breaking down to new lows again."
    },
    {
        "body": "I think it’s rumors that there *may be a resolution to the war soon. Leaders are meeting tomorrow, Zelensky is “cooling off” on NATO, humanitarian pathways are *supposedly being respected..also tomorrow I think is day 14 or 15 which Putin claimed was his initial “plan”. \n\nSo who knows maybe they can agree on a ceasefire in which case markets would probably pump. I really hope I’m right here."
    },
    {
        "body": "[deleted]"
    },
    {
        "body": "They manage the arbitrage for you."
    },
    {
        "body": "It doesn't always retrace, it just usually does."
    },
    {
        "body": "BTC will never be above 42k again"
    },
    {
        "body": "you get +9 points for this comment. I get -6  here: https://www.reddit.com/r/BitcoinMarkets/comments/ta045w/daily_discussion_wednesday_march_09_2022/hzzckg1/\n\nsaying the same thing and explaining why. and I even provided a chart. This sub is filled with lunatics. However they think I'm locked in here with them but really they are locked in here with me :D"
    },
    {
        "body": "> Every time in the past we lost the 50 week MA we dropped to the 200 week\n\nWell that's simply not true."
    },
    {
        "body": "Too many things changing in the last couple of years in btc land and broader economy to really make confident decisions based on price history. \n\nA few positive developments in the next few months could see btc edging near 100k. A few negatives could see us at that 200 week. Fundamentally, I think btc should be in six figures by now given all the circumstances, but we are still in this volatile period of time where people are spooked, highly cautious, and still lumping btc in with \"risk-on assets.\" I think that'll change over time.\n\nI still think \"up\" is the path of least resistance, easily."
    },
    {
        "body": "We are still within the 1-day statistical range. I suspect we see some buyer exhaustion and a equally big volume candle, then sideways or bleed to the bottom of the ascending triangle. \n\nNot saying a breakout above resistance isn't possible, we just have to wait and see"
    },
    {
        "body": "1 week RSI support line breaches and what happens when they reclaim support line > 70 + RSI every time. What you are waiting for hasn't ever happened before\n\n\nhttps://www.tradingview.com/x/dxOIhF5n/\n\nedit: also note the absolutely perfect retest of that support line we just had. My money is on 70 RSI before 30"
    },
    {
        "body": "No conspiracy just incompetence in all they do"
    },
    {
        "body": "Talking about desperation. What emotion do you think, drives you to spam all these worthless and infantile one liners?"
    },
    {
        "body": "Ah finally, a pressure relief for you!\n\n> A woke hypocrite who’d lie about their race to get ahead would also exploit a human crisis to score political points.\n\n> The WAAA act is as vile as @SenWarren herself.\n\nWhen I see messages like that, I'm puzzled... is he just trying to rile up his base or is he trying to convince people from the opposing camp? Because that's not how you do it..."
    },
    {
        "body": "of which year?"
    },
    {
        "body": "At 44k last week he said \"Bitcoin looks good, we're buying\"."
    },
    {
        "body": "When he’s public bull we go down. Mouth shut maybe we don’t go down."
    },
    {
        "body": "people busted his balls because he bull tweeted the pico top of the last big H12 candle that was subsequently immediately retraced. He's basically saying \"i'm not going to jinx it\""
    },
    {
        "body": ">hit 52k before running into a huge resistance\n\n46.5K is now the level to cross, being the price above which STH in general are above water and will no longer push sales. I don't see where any resistance near 52k comes about."
    },
    {
        "body": "Keep zooming…. Bit more….. see it yet?"
    },
    {
        "body": "[removed]"
    },
    {
        "body": "You’re watching too many movies"
    },
    {
        "body": "I don’t see any bull case what so ever. Any pump is weak and generally retraces within hours/days. \n\nI’ve never had a short trade in my life either so not talking pocket. \n\nAll I want is a bull market .... but we are no where near one."
    },
    {
        "body": "Wtf…"
    },
    {
        "body": "We're up 2k from the last local high. Doesn't take much to get everyone in full bulltard mode does it?"
    },
    {
        "body": "Bears are doing just fine they just finished taking profits from 45k shorts. There is no bull trend"
    },
    {
        "body": "Lol.\n\nThey sold at 45k by telling you Russia was buying.\n\nThey are selling to you at 42k by telling you Biden’s executive order is going to change everything and make the bear market go away.\n\nThe juicy liquidations at 43.5k [are also enticing](https://twitter.com/kingfisher_btc/status/1501480441081401348/photo/1)."
    },
    {
        "body": "I think you have your charts upside down again :)"
    },
    {
        "body": "No sellers for a change. About time it stopped."
    },
    {
        "body": "[deleted]"
    },
    {
        "body": "King of Portfolios is probably 50% Amazon Stocks 50% bitcoin  Bill Miller Style.\n https://www.google.com/amp/s/www.coindesk.com/business/2022/01/10/billionaire-investor-bill-miller-now-has-50-of-his-personal-wealth-in-bitcoin/%3foutputType=amp\n\nGold is a worthless Rock loosing buying Power each year."
    },
    {
        "body": "Gold is so boring. If it wasn't such a hassle to sell, my tiny bits would long be sold."
    },
    {
        "body": "Commodities may also price higher as a sort of hard money in a de-globalizing world"
    },
    {
        "body": "Gold is pretty a volatile commidity - It's value dropped 20% from 1980 until the 1999 tech bubble. Then rose to the 2008 financial crash (probably because it was crazily under-evaluated compared to 1980-1999 inflation).\n\nIt seems to enjoy starting its bull runs during financial crashes, but outside of that, its not a good leverage imo. Perhaps it deserves a small position of the portfolio - like 5%?   \n\n\nReal-estate Investment trusts are great leverages since they own physical commodities. But I never leverage into these because I hate what these guys are doing to some areas."
    },
    {
        "body": "you close your short? or do you just mean on the long term timescale?"
    },
    {
        "body": "Elon did tweet tho"
    },
    {
        "body": ">wake me up when Elon tweets about it\n\n[Time to wake up.](https://twitter.com/elonmusk/status/1501449525831081987)"
    },
    {
        "body": "Lose 300,000"
    },
    {
        "body": "is 3k a lot vs your networth? if yes you found the mistake"
    },
    {
        "body": "[deleted]"
    },
    {
        "body": "It takes time, I lost over 5 times that during a mental breakdown at University with too much going on in my personal life when BTC was at 10k.  Almost all my money.  Awful move is an understatement, I'd have over $1 million now if I just held any of the stuff I used to, have my debt paid off parents retired and then some.  I let my whole family down. The feeling never goes away, but balance learning from it with using it as a chip on your shoulder.  Don't make the same mistake again.  You will think low of yourself and that's okay, if you learn to not sulk in self pity but act and grow: being humble is a characteristic of strength.  Again, it takes time.  Don't let it take your happiness away from the things you enjoy in life in the meantime, in the end it's really a minor setback."
    },
    {
        "body": "Stop gambling now and it’s a cheap lesson."
    },
    {
        "body": "[deleted]"
    },
    {
        "body": "You have two choices. Either learn and consider it a $3,000 lesson or don't and prepare for a more expensive lesson."
    },
    {
        "body": "You mentally get over it by saying \"I fucked up!  Wow, that was dumb.  I'm not going to do that again!\"\n\nI don't say that lightly.  We all make mistakes, but a wise person learns from their mistakes and a fool lives in denial.  You've already taken the first smart step, which means you're headed in the right direction.  Keep going.\n\nThat being said...  if you're looking for advice on Bitcoin, my advice is simple:  Buy and hold until the year after the next halving & you're golden.  Right now, that means treat every dollar you spend on Bitcoin as an investment to hold until 2025 (the next halving is in 2024).  [Here's why](https://www.reddit.com/r/CryptoHorde/comments/q604vq/lets_talk_market_cycles_yes_everybody_says_4q_is/hg9w79d/).\n\nP.S.  A guy goes to the doctor and says \"Doc, it hurts when I do *this.*\"  The doctor says \"DON'T DO THAT!\""
    },
    {
        "body": "Time. \n  \nAnd remind yourself that it’s only money.\n\nNow don’t come back here asking how to get over losing $30,000 in a few months. Seriously do yourself a favour and stop using leverage."
    },
    {
        "body": "[deleted]"
    },
    {
        "body": "Learn by the mistakes and trade it back. \nI did exactly the same some time ago. Lost 3k learnt and made it back within 4 months.\nAnd I never leverage trade."
    },
    {
        "body": "trial by fire. if you actually learn from every bad trade eventually you won't make bad trades, and make it all back and then 100x."
    },
    {
        "body": "You can take a break ( 1 month minimum for me) and educate yourself on TA. \n\nI watch streamers like Muleskinner and Mr. Loh on Twitch. They are great educators and you can get some nice free setups."
    },
    {
        "body": "There's no chance of approval. Read the other rejections. Nothing fundamental has changed."
    },
    {
        "body": "100% speculation. I love it."
    },
    {
        "body": "Make up some news, pump it a little, cash out on retail.  Repeat until they give up all hope.  This is how we bear market.\n\n> DCG owns Grayscale Investments, Genesis, CoinDesk, Foundry, Luno, TradeBlock, and HQ"
    },
    {
        "body": "Probably the same thing they would say about Lummis' bill. Neither have been officially introduced afaik."
    },
    {
        "body": "Are you able to shed any light on his campaign promises?"
    },
    {
        "body": "They have strict capital controls that makes arbitrage extremely difficult."
    },
    {
        "body": "What does that mean."
    },
    {
        "body": "Hmm I need to do more financial research into the impact of this on crypto. What’s her Instagram handle?"
    },
    {
        "body": "These crypto assets may be increasingly difficult to comprehend, specially for a person in that field. Luckily i can provide counselling to this desperate model if you provide the ig. lol."
    },
    {
        "body": "link to insta?"
    },
    {
        "body": "anytime, i enjoy it. Made a [video on it](https://www.tradingview.com/chart/SPX/6TaSHCM0-BTC-Foreign-Markets-SPX-Developing-Markets-Lead-Lag-BTC/) if your interested"
    },
    {
        "body": "TradingView, Yahoo and London Stock Exchange. I haven't looked into the developing markets, will put it on my todo list.\n\nIt's quite useful looking at price after close, i.e. LSE before NYSE opening hours. It gives an indication how the NYSE will open"
    },
    {
        "body": "I’m glad I was cautious. Btc is back under 40k. Damn"
    },
    {
        "body": "Mix of older addresses with larger balances and <12 month ones.\n\nNo clear trend. There is on chain liquidity mid 40s that will put the breaks on pumping until it is cleared, but there also isn't much appetite to move coins below 38k."
    },
    {
        "body": "Here’s the thing about Executive Orders—one person, as in a subsequent President, can remove or alter them with the stroke of a pen. That’s why I don’t see deep pocket investors paying much heed to an EO. Now if we see legislation passed, that’s a different variable altogether."
    },
    {
        "body": "I think it might be barting down right now....   Hope it's a fake out, but doubting that."
    },
    {
        "body": "Id rather it just get over quick. slow bleed out is the worst imo, so that's probably what will happen"
    },
    {
        "body": "oops"
    },
    {
        "body": "It would be nice if literally every comment that mentioned Biden didn't devolve into stupid shit like this. The original commenter asked a legit question, when will we hear from Biden regarding the crypto EO, the \"hurr durr Biden has dementia\" comment provides no value."
    },
    {
        "body": "This is really a green light to architect the digital dollar scam coin"
    },
    {
        "body": "What is your point though? That the media shouldn't talk about white supremacists, that they should not report how they are financed or that if they are financed through Bitcoin, not talk about it?\n\nFrom a legislative point of view, if the investigations and/or media can find it out, it is not required to regulate more."
    },
    {
        "body": "Leading the rally"
    },
    {
        "body": "So did zcash"
    },
    {
        "body": "> up on the ratio"
    },
    {
        "body": "70k COW 🐮"
    },
    {
        "body": "FUD"
    },
    {
        "body": "Ok"
    },
    {
        "body": "I guess we will see. \n\nBitcoin in a tight range, anything could happen. But it broke one of several possible down trend triangles on my chart, so could be a higherlow in the making or reversal, who knows.\n\nBut TA all the way!"
    },
    {
        "body": "Good point"
    },
    {
        "body": "We didn't but we thought we did."
    },
    {
        "body": "God I hope so, it's a terrible terrible terrible situation!"
    },
    {
        "body": "Also the initial shock is over, I guess, and there's a bit more certainty now"
    },
    {
        "body": "This is such an obvious answer and I cannot believe people think these platforms simply sell Bitcoin to folks without hedging themselves through near simultaneous purchases. Not doing so would mean going belly up in short space.\n\nI mean why would it be any different to how brokers offer buy/sell quotes on stocks."
    },
    {
        "body": "and the bitcoin"
    },
    {
        "body": "Feels that way doesn’t it"
    },
    {
        "body": "Love this one and how untrue it is. Your probably going to be proven wrong before tomorrow."
    },
    {
        "body": "[deleted]"
    },
    {
        "body": "People downvote you because sometimes you switch narrative on a dime and chalk it up to “things changed so I changed my perspective” even if it’s insanely short term. Also a lot of your posts come off as super manic. \n\nPersonally I like your contributions to this sub. Just stating what is likely apparent to others."
    },
    {
        "body": "I'm honestly just here to see what you post. Not really, but kind of. Learned a lot from you this year."
    },
    {
        "body": "This is indeed beginning to round off like all the other failed pumps in the last few months. I may regret it later, but I'm selling some here expecting further downside."
    },
    {
        "body": "Go look at a BLX chart yourself happened 4 times already, every time it lost the 50 week MA it dropped to the 200MA."
    },
    {
        "body": "Doesn’t that directly contradict what you were saying earlier about there being no case for bulls atm?"
    },
    {
        "body": "Previous Weekly RSI capitulations hit 33 and 28, I'm not sure what you're talking about reclaiming support. If you want to talk about support and resistance, RSI is re-testing the support turned resistance from the July low at 42 https://www.tradingview.com/x/MyG72cXV/"
    },
    {
        "body": "Occam's razor for sure. Possible some of the stability has been from insider front running?"
    },
    {
        "body": "Why are you more puzzled about his tweet than what Elizabeth Warren is up to? That's really what's most puzzling here."
    },
    {
        "body": "Just wait till they realise half the pundits they listen to are engaging in Poe's Law and their only interest is the money they make from trolling people (snowflakes) who are easily led (triggered)."
    },
    {
        "body": "This year, historically 1 year after the post halving run peaks was nearly always a perfect time to buy"
    },
    {
        "body": "If you zoom out, 52k has been a critical level through out all last year and there is a lot of volume in that range.  Moreover, it is the 0.5 fib level from 69 to 33k in this downward cycle."
    },
    {
        "body": "No higher high either"
    },
    {
        "body": "This is the 4hr RSI bear div that always forms lately. We'll get a nice new lower high and a 4hr RSI that peaks much lower than it should if we're actually going up."
    },
    {
        "body": "How is that guy not banned already?"
    },
    {
        "body": ">They \n\nWho?"
    },
    {
        "body": "I don't know man, I think this pump built diffy"
    },
    {
        "body": "seems text book to me\n\nhttps://www.tradingview.com/x/rQhfIRwj/"
    },
    {
        "body": "How much less? If it's better than other things might still be good"
    },
    {
        "body": "This portfolio is waaaaay over leveraged into the US Equities market (which BTC tracks during downtrends).\n\nProbably best not to take portfolio advise from news articles. [Bogleheads](https://www.bogleheads.org/wiki/Asset_allocation) is a more established economic source for portfolio allocation."
    },
    {
        "body": "PAXG crypto?"
    },
    {
        "body": "iShares Physical Gold ETF ;)"
    },
    {
        "body": "[deleted]"
    },
    {
        "body": "Very old and lame meme. To think those competitors would come together to work on BTC… no"
    },
    {
        "body": "Lmfao"
    },
    {
        "body": "Pfff ameteurs!"
    },
    {
        "body": "Diamant balls"
    },
    {
        "body": "would he still have those bitcoins if it wasn't for mtgox? \n\nmtgox gave me diamond hands"
    },
    {
        "body": "Carefully calculated gambles with minimal risk are where the real party's at"
    },
    {
        "body": "> By seeing it as a valuable experience.\n\nYou nailed it."
    },
    {
        "body": "Exactly. It’s like tuition - except that once you pay enough tuition you can stop going to school!"
    },
    {
        "body": "And don’t forget the leverage!"
    },
    {
        "body": "You love to hear it!"
    },
    {
        "body": "Dudes net worth is 3.2 billion and he's still gotta shakedown us retail plebs lol."
    },
    {
        "body": "Safe to say, we would be much better off with the Loomis bill over than the Warren bill. Politics aside, Loomis has contributed to making Wyoming one of the most crypto-friendly states in the union."
    },
    {
        "body": "Link to Loomis bill"
    },
    {
        "body": "It's typical populist bullshit with zero substance.\n\n'We'll build more affordable housing! We'll create millions of new jobs! We'll boost our R&D capabilities and support startups and cutting edge tech! We'll make Korea great again!'\n\nOf course, there's not a word on *how* he plans to do any of that, or perhaps even more importantly, *who is going to pay for it.*\n\nLike, he literally doesn't have anything actionable planned at all, or at least he hasn't disclosed anything. His debate performance has been an absolute joke as well, he just read off a script his lackeys wrote for him and dismissed any questions entirely. He also said some pretty spicy things like claiming he wants to abolish any restrictions on working hours & minimum wage, he thinks gender inequality isn't real (Korean women earn 40% less than men on average), and so on. He's a quintessential 'pull yourselves by the bootstraps' boomer piece of shit and it's depressing as hell that he was even able to run at all, never mind actually win the election."
    },
    {
        "body": "That's not a question of their crypto markets being over-regulated, it's a question of their AML and capital flight controls."
    },
    {
        "body": "you.rinka, she has onlyfans, but her pics can be found here and there. Her insta story with the crypto reference is still availble, will expire soon. She is a bit weird, posts weird stuff, but her body is really nice. Entertaining altogether."
    },
    {
        "body": "other comment"
    },
    {
        "body": "other comment"
    },
    {
        "body": "Do those provide an API? Exporting TradingView data has to be very tedious using the UI."
    },
    {
        "body": "only reason I can see for it going up from here is we all seem pretty sure it wont"
    },
    {
        "body": "it wasn't a dementia comment it was realistic. This is so far off his radar he doesn't know about it because its delegated not because he forgot about it because he has dementia. I do agree he has dementia though but I would have said that if that's what I was trying to convey.\n\nI honestly think #2 Biden donor, Sam from FTX, wrote it and provided it to Whitehouse aides. They probably added some fluff and published it. Thats literally how I think this happened. I don't think Biden had anything to do with it."
    },
    {
        "body": "How is it any different if it's physical or digital?  Fiat monetary policy will always be unhygienic.  Most of us are here because we care about the corn.  \n\nUSD to remain predominant global currency transmitted via USD stablecoin with wealth stored in Digital Gold (Bitcoin)."
    },
    {
        "body": "The point is they use that terminology to make \"icky\" anything they dont like or want to control.  Its the oldest play in the book.  How long before the canadian truckers were white supremacists?  By my count about 5 minutes\n\nOther funny points.  There is no evidence white supremacists are \"financed through bitcoin\".  And even if there was, you  know what else they are \"financed through?\"  The USD.  Gold.  Literally any currency.  Tagging BTC, a currency that happens to threaten the status quo, with \"associated with white supremacy\" is too cute by half.  What a coincedence.\n\nMore importantly though, seeing a white supremacist around every corner has made the term useless.  Might as well be looking for ghosts, boogeymen, pirates.  There might be 1 actual white supremacist for every 10,000 claims by the media.  People have evolved, times have changed.  The left apparently pines for the good ol racism of the 1950's which is by and large completely non existent in 2022."
    },
    {
        "body": "second best comment in the thread (:"
    },
    {
        "body": "wen CYBRTRK?"
    },
    {
        "body": "I know man."
    },
    {
        "body": "No no the obvious answer is that Paypal is betting their entire business on a risky fractional reserve play where they speculate on the price of Bitcoin!!!! ;D"
    },
    {
        "body": "Lmao bruh 🤣 have you ever seen the chart?? It goes up and to the right"
    },
    {
        "body": "Lol you dont see satire even if it punches you in the face, do you?"
    },
    {
        "body": "And boom your wrong"
    },
    {
        "body": "i don't get it"
    },
    {
        "body": "I adopted him.  I like troubled kids.  As long as they're not rangas."
    },
    {
        "body": "its a trading pit. I understand that. Many people don't. Its okay we all enjoooooooy in our own way"
    },
    {
        "body": "We've gone below it and back up again several times. *Eventually* we've gone down to the 200 WMA but thats just saying that BTC have had massive bear markets. We all know that those will diminish with growth. Nothing last for ever and not this, so far not even really true, pattern in the charts."
    },
    {
        "body": "because a weekly rsi can play out over many many months"
    },
    {
        "body": "Yeah he also said “dead cat bounce bull trap”. Both of those comments just a few hours ago."
    },
    {
        "body": "I'm talking about the long term support line on my fucking chart which happens to correspond with ~40"
    },
    {
        "body": "also without pandemic you never hit 33 or anything close to it."
    },
    {
        "body": "Because I'm not an American but I know that you can fuck this up for us all. I understand that Warren isn't our friend but I hope we get better lobbyists than a bunch of racist incels."
    },
    {
        "body": "Yup, Bitcoin entered the world of politics and what we need is people who can convince others, not just stir shit up for retweets and followers. That requires a bit more subtlety than what was shown here..."
    },
    {
        "body": "long term bitcoin chart looks like its rolling over. What if there isn't another cycle"
    },
    {
        "body": "Nice!"
    },
    {
        "body": "No one wants to hear it lol. This could keep going up, sure, but that is not what has been happening lately."
    },
    {
        "body": "I guess you can measure it compared to inflation. [My source for inflation (low effort find)](https://www.in2013dollars.com/us/inflation/1980?amount=1).\n\nCumulative inflation since 1980 until now is 340% i.e. $1 in 1980 has the same purchasing power as $3.40 today.\n\nNow lets look at golds cumulative gains since 1980. Gold closed Q4 2022 at $692. It closed yesterday at $1988. Cumulative gain of 288%. Note: This assumes your hiding gold bullions in your basement. Not taking into consideration the legal storage costs of gold.\n\nSo actually, /u/No_Speaker8945 is correct here. Gold has less purchasing power as it stands. However, I believe gold goes through decades of being undervalued and then corrects with a big price increase. It'll be interesting to compare this again in 5-10 years.\n\nHope that helps"
    },
    {
        "body": "[deleted]"
    },
    {
        "body": "> mtgox gave me diamond hands\n\nI wasn't in Bitcoin back then, but stories about Mt Gox gave me diamond hands!  Their pain became my gain because...  whoa, no..."
    },
    {
        "body": "I would agree, however, my point was there isn't much to comment on without seeing the specifics."
    },
    {
        "body": "Nothing that you can read at the moment, but: https://twitter.com/SenLummis/status/1501576072437059593"
    },
    {
        "body": "You live there or something? If not, why does it matter? Let democracy do its thing"
    },
    {
        "body": "drop me a PM and i'll share some secrets"
    },
    {
        "body": "So you think that this admin is going to be very friendly to crypto then?"
    },
    {
        "body": "No it is Prince John.\n\nr/Qult_Headquarters/comments/tac4de/the_qunt_loren_boebert_is_not_sure_who_is_running/"
    },
    {
        "body": "> How is it any different if it's physical or digital?\n\nCBDC is a surveillance state gift card. It has all the features of totalitarian censorship and surveillance with none of the benefits of cash. Say goodbye to any remnants of financial privacy. Say hello to total control.\n\nSocial credit score too low? Sorry your wallets paused for 48 hours or until you take your mood realignment course. Didn't get your booster shots on time? SSorry your wallets paused for 48 hours or until you submit booster verification. Its extremely dystopian what this will usher in to society. Like black mirror levels dystopianism."
    },
    {
        "body": "Stablecoins can be blacklisted. IE, not fungible."
    },
    {
        "body": "A bunch of the Canadian truckers were white supremacists though? There were confederate and nazi flags all over the place among the supporters"
    },
    {
        "body": "Andrew Anglin/Daily Stormer seems to fit the description of an actual white supremacist and neo-nazi getting funding through bitcoin, why are you angry about the media talking about him?\n\n> Times have changed\n\nNot for the better though..."
    },
    {
        "body": "the cyberattacks will commence when putin is ready"
    },
    {
        "body": "No one wants it now"
    },
    {
        "body": "If satire did that to me I would never speak to satire again. Boundaries, you know?"
    },
    {
        "body": "two wildly different time frames"
    },
    {
        "body": "Never listen to the news buddy."
    },
    {
        "body": "What race is involved everyone in this op is white as sliced bread 😂"
    },
    {
        "body": "Propaganda in a Democratic Society -- Aldous Huxley [1958]\n\n> There are two kinds of propaganda -- rational propa­ganda in favor of\naction that is consonant with the enlightened self-interest of those\nwho make it and those to whom it is addressed, and non-rational\npropa­ganda that is not consonant with anybody's enlight­ened\nself-interest, but is dictated by, and appeals to, passion. Where the\nactions of individuals are con­cerned there are motives more exalted\nthan enlight­ened self-interest, but where collective action has to be\ntaken in the fields of politics and economics, enlight­ened\nself-interest is probably the highest of effective motives. If\npoliticians and their constituents always acted to promote their own\nor their country's long-range self-interest, this world would be an\nearthly paradise. As it is, they often act against their own\ninter­ests, merely to gratify their least creditable passions; the\nworld, in consequence, is a place of misery. **Propa­ganda in favor of\naction that is consonant with en­lightened self-interest appeals to\nreason by means of logical arguments based upon the best available\nevi­dence fully and honestly set forth. Propaganda in fa­vor of action\ndictated by the impulses that are below self-interest offers false,\ngarbled or incomplete evi­dence, avoids logical argument and seeks to\ninfluence its victims by the mere repetition of catchwords, by the\nfurious denunciation of foreign or domestic scape­goats, and by\ncunningly associating the lowest pas­sions with the highest ideals**, so\nthat atrocities come to be perpetrated in the name of God and the most\ncyni­cal kind of Realpolitik is treated as a matter of reli­gious\nprinciple and patriotic duty.\n\nhttps://www.huxley.net/bnw-revisited/#propdem"
    },
    {
        "body": "That's what they said in end of 2018 and look where we are now"
    },
    {
        "body": "You might not have the four year cycle as aggressive as in the past. We definitely are going to have other cycles that will be very rewarding. It's either that or the whole Bitcoin argument falls apart which after all the research I've done doesn't sound likely."
    },
    {
        "body": "My motto for macro positioning is \"scale in when people start earnestly wondering whether we'll ever go up again, and scale out when they start rationalizing why we never need to go down again.\""
    },
    {
        "body": "Thank you that helps immensely. I recall Saylor talking about how the security costs for storing large amounts of gold can definitely eat up some of the benefits over time. I think he said something along the lines of gold is able to maintain its value over space but not as effectively over time.\nFor small holders I guess the security cost is not that much so this does make sense."
    },
    {
        "body": "This is why I shake my head when I see people brag about taking profits.  Everybody swears they'll save the money so they can buy more Bitcoin when the price drops, but most people spend the money on dumb stuff because...  yay, money...  and they end up making more $$$ in the short run while ending up with less BTC in the long run.\n\nI keep meaning to share the story of a guy I met in 2017 who bragged about owning 10 BTC.  When the price skyrocketed, he sold it and bought a stupidly expensive car which was quickly broken into and then broke down and he went broke by 2020 if I'm not mistaken.  Instead of owning 420k worth of Bitcoin, he's living with his parents and working at Costco.  I think it's a Costco.  Dude's a moron.\n\ntl;dr: HODL!"
    },
    {
        "body": "Completely agree, but one of these congressmen has been overwhelmingly positive toward crypto, while the other one has been overwhelmingly negative."
    },
    {
        "body": "Ty"
    },
    {
        "body": ">You live there or something? If not, why does it matter?\n\nUsed to. The guy asked me, so I answered. Not sure what's the problem?"
    },
    {
        "body": "From what I've seen there is nobody pro crypto in the Democrat party. The loudest anti crypto people are all democrats. This is first had observation of the various hearings in congress as well as from the horses mouth statements in public and Twitter. I think they are pro CBDC because they are control freak psychopaths and cbdc is ultimate control tool."
    },
    {
        "body": "lmao thats hilarious. Good ole prince jon"
    },
    {
        "body": "CBDC is cash with a remote\nKill switch."
    },
    {
        "body": "A nazi flag which the majority of the protestors detested, and yelled at the guy to GTFO.\n\nYa, those couple of suspiciously convenient nazi flags that the canucks forcefully detested and removed means white supremacy was \"all over the place\".  As I said, the media uses it to make things radioactive to non critical thinkers.  Unfortunately, it works."
    },
    {
        "body": "also no one \"gets funding\" through bitcoin, if they (the infinitesimally small amount of actual white supremacists) have it, they bought.  Its not a private company putting money in things.  It would be the equivalent of saying they are \"funded\" through gold bars, or dollar bills, or cans of food.  Something they purchased isnt \"funding\" them.\n\nThey are also \"sustained by\" water, food and medicine.  We better demonize those too right?"
    },
    {
        "body": "If you think times havent changed for the better from 1950s to 2022, you either have something wrong with your brain or its been pickled by propaganda."
    },
    {
        "body": "I want all that corn"
    },
    {
        "body": "Guess better tell all the long term holders to sell if that's the case. 🙄"
    },
    {
        "body": "I see"
    },
    {
        "body": "have fun waiting for another miner capitulation when we just had one mid bull market in may 2021. I'm sure its coming very soon."
    },
    {
        "body": "I see what you did, let's settle on misogynist incels."
    },
    {
        "body": "Exactly this I remember when we broke 6k support to the downside at the end of 2018 and fell to 3k some people were saying we’d never reach 20k again"
    },
    {
        "body": "You just seem very passionate about it. Nothing wrong with that, but kinda odd to be so involved in the politics of a country you don't live in imo 🤷‍♂️ No hate though"
    },
    {
        "body": "Just the other day Ron Wyden was advocating for crypto."
    },
    {
        "body": "I'm sorry for you that Biden didn't came up with a regulation allowing you to lash out at him and that you had to resort to personal attack. Better luck next time?"
    },
    {
        "body": "sir your purchase put you over your carbon credit limit for the month, for your safety we are going to restrict purchases to the following approved ESG items."
    },
    {
        "body": "There was also Queen Romana. Face it, you went to a protest and it was full of idiots and now you are angry because it makes you look bad by association when the media reports about it. But face it, the majority already think that antivax/antimaskers are idiots... so maybe it isn't only by association that you are looking bad. Your opinion is that people are manipulated by the MSM, the opinion of the majority is that the fringe is easily manipulated by foreign agents.\n\nhttps://www.theguardian.com/media/2022/mar/04/bot-holiday-covid-misinformation-ukraine-social-media\n\nWhen I said \"not for the better, times have changed\", I was referring to this:\n\nhttps://www.texastribune.org/2018/05/03/hysteria-over-jade-helm-exercise-texas-was-fueled-russians-former-cia-/\n\nThey found out of to create chaos... and if you study a bit the last 10 years you may find you have been fooled a few times."
    },
    {
        "body": "Lol pretending like there was only a single nazi or confederate flag 😂 I’d link sources but you’re obviously one of those nut jobs who shouts “fake nooze!!” whenever your worldview is challenged"
    },
    {
        "body": "So what is your point, that media shouldn't report on facts? Or are you complaining about word usage? I don't see what your point is...\n\nWhite supremacists get donations in bitcoin, the media reports it. What is making you angry? Are you advocating for media censorship?"
    },
    {
        "body": "Oh when you said \"times have changed\", you didn't mention 1950... what is it, the golden age of racism?"
    },
    {
        "body": "I’m holding strong bud.\n\nJust feels futile at the moment. I’m really hoping this isn’t a 2 or 3 year period before some action."
    },
    {
        "body": "k"
    },
    {
        "body": "lol, oof."
    },
    {
        "body": "Nice try, hating one piece of shit (that happens to be a woman) isn't mysogyny. Women want equal treatment they can get it. Op rips gensler just as ruthlessly"
    },
    {
        "body": "Still have friends in the country, still do business there now and then. Also, it's annoying to see nutjobs taking over the world, no matter how close or far from home."
    },
    {
        "body": "needle in the haystack I guess"
    },
    {
        "body": "your not making any sense. get some rest. come back later\n\nyou gonna come around and apologize for Warren next?\n\nhttps://twitter.com/twobitidiot/status/1501722352647905283"
    },
    {
        "body": "Don’t know why you got downvoted. MasterCard bought a company who create a way to automatically count carbon impact and freeze further purchasing at a specified threshold."
    },
    {
        "body": "you lucked out with your UST contagion."
    },
    {
        "body": "Ruthlessness is not what is helping you convince the opposing camp. It only helps you get social media magic points and engagement through angst. This sub deserves better so if you could link to the law proposal instead next time, it would be nice.\n\nWe are all pro-bitcoin in here, but we aren't all American conservatives... so don't divide us with stupid partisan bullshit."
    },
    {
        "body": "Doesn't sound like they're taking over the world 😂 populists are nationalist, isolationist types. For the most part, they wanna just fuck off from foreign entanglements"
    },
    {
        "body": "I was just showing empathy... it should have been clear. The life of a partisan isn't easy."
    },
    {
        "body": "Haha k."
    },
    {
        "body": "Bitcoin isn't a gray area like abortion. Where you can nitpick to death and bend and lawyer away definitions of life and birth etc. It is absolute non-negotiable truth. It's completely incompatible with liberal and progressive values."
    },
    {
        "body": "Like half of the world is currently ruled by populist governments or have been very recently. UK, Russia, Japan, India, Brazil, Turkey, Israel, most of Eastern Europe and Balkans, now Korea as well. Many other countries had a populist leadership recently or are close to electing one, such as the US, France, Italy, etc. All of these fuckers are anti-truth, anti-accountability, anti-prettymucheverythinggood, and if that doesn't upset you I salute your mental stability but for me, this sort of thing is honestly straight up depressing."
    },
    {
        "body": "On bitcoin I'm very proudly partisan."
    },
    {
        "body": "you think that had nothing to do with it? I mean it was a ponzi forcing massive selling"
    },
    {
        "body": "My country is very open about bitcoin... we also have abortion, healthcare, free education, about as many guns as you but we also have much healthier politics, so?"
    },
    {
        "body": "I'm pretty progressive and liberal, socially and economically. But I love Bitcoin. If anything it makes me think Bitcoin is even more valuable. People of all political perspectives should be able to understand why Bitcoin is important and valuable. Just because you have a certain political viewpoint doesn't mean that only people with your views can understand Bitcoin. If you make Bitcoin only for conservatives, you're forfeiting half of its potential."
    },
    {
        "body": ">It's completely incompatible with liberal and progressive values.\n\nTo get this point, you need to have a basic understanding of not only bitcoin, but also free market capitalism.  Doesn't seem like a big ask, but let's be real."
    },
    {
        "body": "Globalism is an idealist's fantasy"
    },
    {
        "body": "You know that's not what I'm talking about."
    },
    {
        "body": "[removed]"
    },
    {
        "body": "It's fundamentally incompatible unless you're plans include changing bitcoin, banning private wallets, crippling users with taxes on unverifiable holdings etc. Bitcoin negates the forced participation in every single liberal/progressive program or idea. Liberals rely on forced participation in their shitty ideas and the expansion of government and inflation of fiat to run and maintain their shitty ideas. Bitcoin is the opposite of forced participation and is a direct means to defund government. A government that cannot inflate away money and tax and regulate without limit cannot implement liberal agendas.\n\nPredictions: democrats will attempt to ban private wallets. Democrats will attempt to force feed a CBDC"
    },
    {
        "body": "Very edgy."
    },
    {
        "body": "I don't think it's a coincidence democrats overwhelmingly hate crypto if that's what you mean. They are pro cbdc though they'd love nothing more than the black mirror dystopian total control it would provide. Here's a scenario that would make democrats coooooom\n\n>[phone chimes and a voice comes on] sir, your purchase put you over your carbon credit limit for the month, for your safety we are going to restrict purchases to the following approved ESG items until you top up your carbon credit balance and complete your esg compliance affirmation module."
    },
    {
        "body": "[removed]"
    },
    {
        "body": "Silly talking points... we can see from far away that the democrat/republican divide is totally fucked up. I keep hearing that democrats hate freedom in this sub but I keep seeing stupid anti-freedom shit republicans do, things shocking enough that it gets reported this side of the pond... so lets just keep it focused on bitcoin."
    },
    {
        "body": "[removed]"
    },
    {
        "body": "[removed]"
    },
    {
        "body": "It's not silly. Biden issued executive orders today begging his people to make a case for cbdc. They want power to shut off mysogynist incels like they are Russian oligarchs. Even if you are suspected of being a non compliant mysogynist they want to be able to shut off your life until you complete your attitude modification training module. They're literally horny over this idea."
    },
    {
        "body": "[removed]"
    },
    {
        "body": "Just re-read your comment.\n\nToo much 4chan or some other shit consumption..."
    },
    {
        "body": "You mean just observing China? Every thing I said is already in use in China or can be switched on any time"
    },
    {
        "body": "What does China have to do with this?"
    },
    {
        "body": "Your suggesting I got these concepts from strange fringe internet websites when they're directly inspired by reality"
    }
]